jayden-sudo/POKER-NOW/devices/xingzhi-cube-1.54tft-wifi/sdkconfig.defaults
# --- 目標晶片:ESP32-S3(雙核 240MHz)---
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# --- 控制台走 USB-Serial-JTAG(USB-C,GPIO19/20;demo 同)---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- Flash 8MB QIO(Winbond W25Q64,demo 已驗證 QIO;此處與 zuowei 的 DIO 不同,勿互抄)---
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
# demo 用 SINGLE_APP_LARGE;poker 換自訂分區容 voice(§12.2)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- 內置 8MB Octal PSRAM(硬性 OCT,§11)---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# --- 主棧 & FreeRTOS(demo 12288 是給 opus 的;撲克無 opus → 8192,§12.1)---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# --- LVGL 字體(四機統一三檔:14/20/28)---
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y

# --- Wi-Fi 僅用於 ESP-NOW:關 AMPDU 省內存(demo 已驗證)---
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
